---
kind: other
id: Methods.T:Autodesk.Revit.Creation.ItemFactoryBase
source: html/5a2cc62e-a64c-c78f-25c7-4d1442b07d7e.htm
---
# ItemFactoryBase Methods

Causes the object to release immediately any resources it may be utilizing.